[
    {
      "id": 1,
      "title": "Grand Opening of University Research Center",
      "body": "The university has officially launched a cutting-edge research center, focusing on innovation in biotechnology. Equipped with state-of-the-art technology, the center aims to support research projects benefiting students and faculty members. The initiative fosters collaborations with scientific institutions worldwide.",
      "image": "images/1.jpg",
      "date": "2025-04-10",
      "comments": [
        "This is a great step forward for research!",
        "Looking forward to seeing groundbreaking projects from this center!"
      ]
    },
    {
      "id": 2,
      "title": "Annual Student Leadership Conference",
      "body": "The annual Student Leadership Conference witnessed enthusiastic participation from students and faculty members. Sessions covered global challenges, education trends, and leadership development, with students sharing innovative ideas on shaping the future of higher education.",
      "image": "images/2.jpg",
      "date": "2025-04-15",
      "comments": [
        "One of the most inspiring conferences I've attended!",
        "Great to see students stepping up as future leaders!"
      ]
    },
    {
      "id": 3,
      "title": "New Career Development Program Launched",
      "body": "A new university training program has been introduced to equip students with leadership and entrepreneurial skills. Designed with input from industry experts, the program provides practical training, mentorship, and career-building workshops to prepare students for future challenges in various fields.",
      "image": "images/3.png",
      "date": "2025-04-20",
      "comments": [
        "This program is exactly what students need to succeed!",
        "Excited to enroll and improve my skill set!"
      ]
    },
    {
      "id": 4,
      "title": "Intercollege Sports Championship",
      "body": "The university hosted an exciting sports championship featuring football, basketball, and track events. The tournament encouraged teamwork and healthy competition among students from different colleges. Victorious teams were awarded trophies at the closing ceremony.",
      "image": "images/4.jpg",
      "date": "2025-04-25",
      "comments": [
        "It was an amazing event!",
        "I hope to participate in the next championship!"
      ]
    },
    {
      "id": 5,
      "title": "Entrepreneurship Workshop",
      "body": "A dynamic entrepreneurship workshop was held, featuring industry experts guiding students on how to transform ideas into successful projects. Interactive sessions provided valuable insights into startup development and investment strategies.",
      "image": "images/5.jpg",
      "date": "2025-05-01",
      "comments": [
        "The workshop was extremely useful!",
        "Looking forward to more events like this!"
      ]
    },
    {
      "id": 6,
      "title": "Student Art Exhibition",
      "body": "The Fine Arts Faculty organized an exhibition showcasing creative artworks by students. Paintings, sculptures, and digital designs were displayed, reflecting their talents and artistic vision.",
      "image": "images/6.jpg",
      "date": "2025-05-05",
      "comments": [
        "The artworks were truly impressive!",
        "Loved seeing everyone's creativity shine!"
      ]
    },
    {
      "id": 7,
      "title": "Climate Change Awareness Seminar",
      "body": "Professors and environmental specialists hosted a seminar discussing climate change effects and possible solutions. The event encouraged students to engage in sustainability projects within their communities.",
      "image": "images/7.jpg",
      "date": "2025-05-10",
      "comments": [
        "Very informative seminar!",
        "We need more events like this!"
      ]
    },
    {
      "id": 8,
      "title": "Class of 2025 Graduation Ceremony",
      "body": "The university celebrated the graduation of the 2025 class with a grand ceremony. Families and faculty members gathered to honor the students for their achievements, marking an unforgettable milestone in their academic journey.",
      "image": "images/8.jpg",
      "date": "2025-05-15",
      "comments": [
        "Congratulations to all graduates!",
        "Such a beautiful celebration!"
      ]
    },
    {
      "id": 9,
      "title": "New Student App Launched",
      "body": "A new app has been introduced to streamline university services, allowing students to register for courses, access campus news, and interact with academic advisors. The app aims to enhance the student experience with seamless digital tools.",
      "image": "images/9.png",
      "date": "2025-05-20",
      "comments": [
        "This app will make student life so much easier!",
        "Exactly what we needed!"
      ]
    },
    {
      "id": 10,
      "title": "Health Awareness Campaign",
      "body": "A university-wide health campaign was conducted to educate students about proper nutrition and physical wellness. Free medical checkups and consultations were provided as part of the initiative.",
      "image": "images/10.png",
      "date": "2025-05-25",
      "comments": [
        "This campaign was really helpful!",
        "Thanks to the university for organizing this!"
      ]
    }
  ]